tests/requests/issues/SE-2974.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch">
 <SOAP-ENV:Body>
 <ns1:searchRequest>
 <ns1:query>marc.001a=126726007</ns1:query>
 <ns1:agency>131170</ns1:agency>
 <ns1:profile>Cicero forskningsbiblioteker</ns1:profile>
 <ns1:start>1</ns1:start>
 <ns1:stepValue>10</ns1:stepValue>
 <ns1:objectFormat>marcxchange</ns1:objectFormat>
 <ns1:collectionType>manifestation</ns1:collectionType>
 <ns1:repository>staging-rawrecords</ns1:repository>
 </ns1:searchRequest>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
