xml/request/rank_boost.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch"><SOAP-ENV:Body>
<ns1:searchRequest>
    <ns1:query>danmark</ns1:query>
    <ns1:start>1</ns1:start>
    <ns1:stepValue>2</ns1:stepValue>    
    <ns1:userDefinedBoost>
        <ns1:rank>rank_title</ns1:rank>
        <ns1:boostField>
            <ns1:fieldName>dc.title</ns1:fieldName>
            <ns1:fieldValue>bog</ns1:fieldValue>
            <ns1:weight>4</ns1:weight>
        </ns1:boostField>
    </ns1:userDefinedBoost>    
</ns1:searchRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>
